[{"Number":1,"Name":"LewisÊCabernet Sauvignon Napa Valley","Notes":"Remarkably elegant and refined for a wine of this size and depth, with tiers of plum, blackberry and currant flavors, as well as subtle touches of black licorice that remain pure and graceful on the long, lingering aftertaste. Drink now through 2028. 1,600 cases made. ÑJL","Year":2013,"Score":95,"Price":"$90 ","":null},
{"Number":2,"Name":"Domaine SereneÊChardonnay Dundee Hills Evenstad Reserve","Notes":"Focused and expressive, this is layered with wet stone, tangy citrus, pear and green guava flavors that swirl through an expansive finish, gaining momentum and extra dimensions with each sip. Drink now through 2024. 2,000 cases made. ÑHS","Year":2014,"Score":95,"Price":"$55 ","":null},
{"Number":3,"Name":"Beaux FrresÊPinot Noir Ribbon Ridge The Beaux Frres Vineyard","Notes":"Supple, expressive and multilayered, exhibiting flavors of plum, currant, pomegranate and violet that come together harmoniously, persisting into the long and exceptionally well-balanced finish. Drink now through 2024. 2,405 cases made. ÑHS","Year":2014,"Score":95,"Price":"$90 ","":null},
{"Number":4,"Name":"Chteau ClimensÊBarsac","Notes":"There's loads here, with apricot, nectarine and clementine flavors stitched with a racy orange zest note to give energy, while tropical papaya and mango flavors add a sublimely creamy edge. The finish sails on and on, coating the palate with a porcelain feel, while an echo of bitter almond lingers effortlessly, like a lace curtain hanging on an endless breeze. Stunning. Best from 2018 through 2043. 1,417 cases made. ÑJM","Year":2013,"Score":97,"Price":"$68 ","":null},
{"Number":5,"Name":"Produttori del BarbarescoÊBarbaresco Asili Riserva","Notes":"Intense aromas of cherry, rose, licorice and tar pick up tobacco, spice and mineral elements on the palate. Concentrated, yet elegant and expressive, with more to give. Ends with a long aftertaste of fruit, underbrush and mineral. Best from 2018 through 2032. 1,110 cases made. ÑBS","Year":2011,"Score":96,"Price":"$59 ","":null},
{"Number":6,"Name":"Orin SwiftÊMachete California","Notes":"Generous and expressive, big and brawny, this offers a mouthful of tannins but also brims with flavors and aromas, including Earl Grey tea, dark chocolate, dried violet and toasted gingerbread. Rich notes of plum and black cherry are balanced by forest floor and earth accents, which linger on the long finish. Petite Sirah, Syrah and Grenache. Drink now through 2030. 15,500 cases made. ÑMW","Year":2014,"Score":94,"Price":"$48 ","":null},
{"Number":7,"Name":"RidgeÊMonte Bello Santa Cruz Mountains","Notes":"A beautifully structured wine, with firm acidity and tannins that show grip and grit amid a core of dense, tense currant and blackberry fruit, turning juicy. Those seeking classic old-school Cabernet will embrace this. Cellaring for five to seven years is the right approach. Cabernet Sauvignon, Merlot, Cabernet Franc and Petit Verdot. Best from 2020 through 2035. 5,243 cases made. ÑJL","Year":2012,"Score":94,"Price":"$175 ","":null},
{"Number":8,"Name":"AntinoriÊToscana Tignanello","Notes":"Aromas of graphite, smoke and tobacco introduce the cherry flavor in this expressive, focused red. Firm tannins and lively acidity balance the fruit and purity, while herbal, spice and mineral elements all gather steam as this plays out on the long finish. Sangiovese, Cabernet Sauvignon and Cabernet Franc. Best from 2017 through 2027. 2,500 cases imported. ÑBS","Year":2013,"Score":94,"Price":"$105 ","":null},
{"Number":9,"Name":"Chteau Smith-Haut-LafitteÊPessac-Lognan White","Notes":"This has a gorgeous feel, with opulent fruit offset by racy herb notes and acidity, showing lemon sherbet, shortbread and white peach flavors backed by a salted butterÐ and tarragon-laced finish, with hints of talc and fennel skittering in the background. Seriously long and still a touch youthful on the finish, this is one for the cellar. Sauvignon Blanc, Sauvignon Gris and Smillon. Best from 2017 through 2023. 2,500 cases made. ÑJM","Year":2013,"Score":96,"Price":"$106 ","":null},
{"Number":10,"Name":"Hartford FamilyÊZinfandel Russian River Valley Old Vine","Notes":"Plump and fleshy, with a dense core of focused tannins and lively acidity. Aromas of ripe black raspberry, anise and licorice open to layered, slightly jammy flavors of black cherry, blueberry pie and smoky cracked pepper. Drink now through 2024. 2,200 cases made. ÑTF","Year":2014,"Score":93,"Price":"$38 ","":null},
{"Number":11,"Name":"Hamilton RussellÊChardonnay Hemel-en-Aarde Valley","Notes":"Ripe and rippling with tension, featuring Jonagold apple, white peach, mirabelle plum and honeysuckle notes coiled at the core. Accents of heather and hazelnut extend slowly through the citrus oil and mineral-edged finish. Best from 2017 through 2022. 2,700 cases imported. ÑJM","Year":2015,"Score":94,"Price":"$37 ","":null},
{"Number":12,"Name":"Abadia RetuertaÊVio de la Tierra de Castilla y Len Seleccin Especial Sardon de Duero","Notes":"A polished texture carries harmonious flavors of black cherry, cola, licorice and mineral in this focused red. Well-integrated tannins and balsamic acidity lend this a balanced structure. Reserved but deep. Drink now through 2022. 31,150 cases made. ÑTM","Year":2012,"Score":93,"Price":"$28 ","":null},
{"Number":13,"Name":"ReynvaanÊSyrah Walla Walla Valley In The Rocks","Notes":"Supple and expressive, this opens up like a giant flower, spreading the dark plum, blackberry, crme frache and spice flavors throughout the seamless whole. The finish sails on against barely noticeable tannins. This has tremendous power, but feels like it's floating. Drink now through 2025. 602 cases made. ÑHS","Year":2013,"Score":97,"Price":"$70 ","":null},
{"Number":14,"Name":"CarlisleÊZinfandel Russian River Valley Montafi Ranch","Notes":"Zinfandel doesn't get much better than this. Rich aromas of black raspberry and orange zest open to balanced, complex and luxurious flavors of blackberry, mint and baking spices. A knockout. Drink now through 2027. 871 cases made. ÑTF","Year":2014,"Score":96,"Price":"$47 ","":null},
{"Number":15,"Name":"M. MarengoÊBarolo Bricco delle Viole","Notes":"Shows fine integration between fruit and wood, with sweet cherry and strawberry flavors matched to spice, floral and briar accents. Fresh, vibrant and firmly structured, this is long on the fruit-, spice- and mineral-tinged finish. Shows fine balance and expression. Best from 2018 through 2032. 333 cases made. ÑBS","Year":2012,"Score":94,"Price":"$53 ","":null},
{"Number":16,"Name":"Chteau CoutetÊBarsac","Notes":"Unctuous and ripe, showing mouthfilling flavors of almond cream, ginger, heather honey and apricot, this will need time to unwind fully, but when it does, expect more pineapple, maple and singed orange notes, as this has some depth and power in reserve, as well as more than enough cut for balance. A beauty in the making. Best from 2018 through 2038. 2,833 cases made. ÑJM","Year":2013,"Score":96,"Price":"$41 ","":null},
{"Number":17,"Name":"Merry EdwardsÊSauvignon Blanc Russian River Valley","Notes":"Succulent, lush and rich, with fleshy mango, melon and peach flavors up front, leading to a core of pineapple, lemon and honeysuckle notes. The smoky edge and nervy acidity weave in and out, giving this a fresh finish. Drink now. 9,500 cases made. ÑMW","Year":2014,"Score":93,"Price":"$32 ","":null},
{"Number":18,"Name":"Condado de HazaÊRibera del Duero","Notes":"This rich red shows a deep core of plum, bramble and mineral, with notes of loam and game that impart a savory character. Solid tannins support a thick texture, while balsamic acidity keeps this balanced. Austere but harmonious. Drink now through 2024. 35,000 cases made. ÑTM","Year":2012,"Score":93,"Price":"$25 ","":null},
{"Number":19,"Name":"ArcanumÊToscana Il Fauno","Notes":"A polished, flavorful red, boasting floral, black currant, raspberry and spice flavors. Firm yet harmonious, with the fine aftertaste lingering with fruit, iron, tobacco and tea elements. Merlot, Cabernet Franc, Cabernet Sauvignon and Petit Verdot. Drink now through 2024. 11,829 cases made. ÑBS","Year":2012,"Score":93,"Price":"$30 ","":null},
{"Number":20,"Name":"TurleyÊZinfandel Paso Robles Ueberroth Vineyard","Notes":"This potent red is loaded with personality, featuring aromas of smoky black raspberry and licorice that open to complex, dense flavors of dried cherry, cracked pepper beef and grilled herb. The tannins are big and framed by loamy mineral details. Drink now through 2028. 1,800 cases made. ÑTF","Year":2013,"Score":94,"Price":"$48 ","":null},
{"Number":21,"Name":"SparkmanÊCabernet Sauvignon Columbia Valley Holler","Notes":"Dense and focused, with a tangy edge to the dark plum and currant flavors, hinting at stony mineral and dusky spice flavors as the finish persists impressively against fine tannins. Best from 2018 through 2023. 912 cases made. ÑHS","Year":2013,"Score":94,"Price":"$32 ","":null},
{"Number":22,"Name":"CuneÊRioja Gran Reserva","Notes":"This generous red shows a traditional character, with leafy, dried herb, tea and spice notes framing dried cherry, licorice and leather flavors. Firm tannins and balsamic acidity impart structure, and this shows plenty of depth, with a juicy, spicy finish. Drink now through 2025. 600 cases imported. ÑTM","Year":2010,"Score":94,"Price":"$33 ","":null},
{"Number":23,"Name":"MocaliÊBrunello di Montalcino","Notes":"This lively red exhibits cherry, strawberry, eucalyptus, tobacco and mineral flavors. The firm tannins work in tandem with the bright acidity, leaving a long, refreshing finish that echoes the fruit, earth and savory elements. Best from 2018 through 2028. 3,800 cases made. ÑBS","Year":2011,"Score":93,"Price":"$40 ","":null},
{"Number":24,"Name":"DuMOLÊSyrah Russian River Valley","Notes":"This is plush, rich and impeccably structured, with floral blueberry and raspberry aromas accented by smoky pepper and complex, expressive flavors that combine mineral-tinged tannins with plump fruit. Best from 2018 through 2030. 1,100 cases made. ÑTF","Year":2014,"Score":94,"Price":"$55 ","":null},
{"Number":25,"Name":"Villa PilloÊToscana Borgoforte","Notes":"Enticing aromas of violet, black currant and rosemary are accented by licorice and tobacco flavors in this fluid and harmonious red, with fine tannins gracing the long finish. Sangiovese, Cabernet Sauvignon and Merlot. Drink now through 2022. 12,500 cases made. ÑBS","Year":2014,"Score":91,"Price":"$12 ","":null},
{"Number":26,"Name":"Bodegas y Viedos MaurodosÊToro San Romn","Notes":"The polished texture masks depth and muscle in this powerful red, which shows blackberry, anise, tar and mineral flavors, with spicy and floral highlights. Firm tannins and fresh acidity lend good balance. Expressive, in an austere way. Drink now through 2027. 7,750 cases made. ÑTM","Year":2012,"Score":95,"Price":"$65 ","":null},
{"Number":27,"Name":"MatthewsÊClaret Columbia Valley","Notes":"Firm and focused, with crinkly tannins around a sleek core of blackberry, currant and plum flavors that keep singing on the expressive finish. This has room to grow. Cabernet Sauvignon, Cabernet Franc, Merlot, Malbec and Petit Verdot. Drink now through 2022. 2,129 cases made. ÑHS","Year":2013,"Score":93,"Price":"$40 ","":null},
{"Number":28,"Name":"Domaine CarnerosÊBrut Carneros Ultra","Notes":"Captivating aromas of Asian pear, mature apple and fresh ginger open to complex and polished flavors of brioche, spicy hazelnut and crme brle. Drink now through 2018. 2,700 cases made. ÑTF","Year":2011,"Score":93,"Price":"$42 ","":null},
{"Number":29,"Name":"Tenuta di TrinoroÊToscana Le Cupole","Notes":"Alluring scents of ripe cherry, mulberry and fresh herbs complement concentrated flavors of cherry and sweet spice in this red. Offers a backbone of mouthcoating tannins and remains integrated as the finish lingers. Merlot, Cabernet Franc and Cabernet Sauvignon. Best from 2018 through 2027. 4,600 cases made. ÑBS","Year":2014,"Score":93,"Price":"$27 ","":null},
{"Number":30,"Name":"MollydookerÊShiraz McLaren Vale Carnival of Love","Notes":"Bold, expressive, velvety and generous, with ripe cherry and plum flavors at the core. Complex details of vanilla bean, licorice, Earl Grey tea and gingerbread explode on the long finish. Drink now through 2030. 1,467 cases made. ÑMW","Year":2014,"Score":95,"Price":"$75 ","":null},
{"Number":31,"Name":"TenshenÊWhite Central Coast","Notes":"This expressive white is aromatic and juicy, featuring a rich, ripe, fleshy core of apricot and peach flavors, with accents of vanilla bean, honeysuckle and melon. A spicy note lingers on the long finish. Viognier, Roussanne, Grenache Blanc and Chardonnay. Drink now. 5,100 cases made. ÑMW","Year":2015,"Score":92,"Price":"$20 ","":null},
{"Number":32,"Name":"IntrinsicÊCabernet Sauvignon Columbia Valley","Notes":"Firm in texture, brimming with raspberry, black cherry, violet and herb flavors that come together harmoniously on the finish against refined tannins. Offers presence and persistence. Best from 2018 through 2024. 30,000 cases made. ÑHS","Year":2014,"Score":92,"Price":"$22 ","":null},
{"Number":33,"Name":"Concha y ToroÊCabernet Sauvignon Puente Alto Don Melchor","Notes":"Suave and refined, with rich, dense flavors of dried berry, dark plum, rose petal and bramble. Offers fine-grained tannins and accents of green olive. Finishes with hints of hot stone, dried beef and white pepper. Complex. Drink now through 2022. 7,400 cases made. ÑKM","Year":2012,"Score":95,"Price":"$125 ","":null},
{"Number":34,"Name":"John DuvalÊPlexus Red Barossa Valley","Notes":"A sophisticated, spicy mix of date bread, cherry compote and clove flavors. Plump and velvety, with persistence and harmony on the finish. Shiraz, Grenache and Mourvdre. Drink now through 2026. 1,000 cases imported. ÑMW","Year":2014,"Score":93,"Price":"$40 ","":null},
{"Number":35,"Name":"SojournÊPinot Noir Sonoma Coast Gap's Crown Vineyard","Notes":"Lightly aromatic, but rich and layered, this offers excellent density and depth, with fine-grained tannic grip and a long, persistent finish that keeps flashing the core flavors. Drink now through 2020. 1,350 cases made. ÑJL","Year":2014,"Score":94,"Price":"$59 ","":null},
{"Number":36,"Name":"G.D. VajraÊBarolo Bricco delle Viole","Notes":"Graphite and iron aromas lead off, with cherry, floral, licorice, tea and underbrush flavors. This is intense, vibrant and resonant on the long, fruit- and mineral-infused aftertaste. Best from 2019 through 2032. 1,500 cases made. ÑBS","Year":2011,"Score":95,"Price":"$70 ","":null},
{"Number":37,"Name":"CayuseÊSyrah Walla Walla Valley Cailloux Vineyard","Notes":"Broad and expressive, playing the cherry, raspberry and pear notes against fine tannins. Picks up tobacco, tar and mineral notes as the finish sails on. Has terrific presence without weight. Drink now through 2025. 846 cases made. ÑHS","Year":2013,"Score":96,"Price":"$80 ","":null},
{"Number":38,"Name":"RameyÊChardonnay Russian River Valley Ritchie Vineyard","Notes":"Shows amazing vibrancy and purity of flavor, brimming with juicy, lemon-scented green apple, white peach and tangerine notes, enlivened by zesty acidity and a long, persistent aftertaste that maintains focus and depth. Drink now through 2020. 1,250 cases made. ÑJL","Year":2013,"Score":94,"Price":"$65 ","":null},
{"Number":39,"Name":"Bodegas BorsaoÊGarnacha Campo de Borja Tres Picos","Notes":"A plush texture masks the firm structure of this red, as blackberry and boysenberry flavors mingle with notes of toast, menthol and mineral, backed by well-integrated tannins and juicy acidity. A modern style, with balance and depth. Drink now through 2020. 10,000 cases made. ÑTM","Year":2014,"Score":91,"Price":"$18 ","":null},
{"Number":40,"Name":"Fattoria di FelsinaÊChianti Classico Berardenga","Notes":"Rich and sumptuous, boasting pure flavors of cherry and raspberry, matched to a juicy texture. There are plenty of tannins neatly folded into the overall structure, with hints of mineral and tea on the long, expansive finish. Best from 2017 through 2024. 15,000 cases made. ÑBS","Year":2013,"Score":92,"Price":"$26 ","":null},
{"Number":41,"Name":"KonoÊSauvignon Blanc Marlborough","Notes":"This refreshing white offers a clear, focused mix of passion fruit, lime, mango and green apple flavors on a light, smooth body. Finishes with a succulent juiciness, showing echoes of lemon verbena. Drink now. 80,000 cases made. ÑMW","Year":2015,"Score":90,"Price":"$12 ","":null},
{"Number":42,"Name":"Via MontesÊCabernet Sauvignon Colchagua Valley Classic Series","Notes":"There's minerally freshness to the ripe dark plum, blackberry and cherry flavors, with peppery hints. Well-structured and crisp midpalate, featuring Asian spice and black fig notes on the finish. Drink now through 2020. 50,000 cases imported. ÑKM","Year":2014,"Score":90,"Price":"$13 ","":null},
{"Number":43,"Name":"St.-CosmeÊCtes du Rhne","Notes":"Ripe, with vivid blueberry and boysenberry fruit, harnessed on the back end by a bold graphite edge. Anise and violet notes add range. Drink now through 2019. 25,000 cases made. ÑJM","Year":2015,"Score":91,"Price":"$16 ","":null},
{"Number":44,"Name":"CaymusÊCabernet Sauvignon Napa Valley Special Selection","Notes":"This zeroes in on a rich, hedonistic core of wild berry, blackberry, plum and currant flavors, with a graceful, elegant mouthfeel and supple, caressing tannins. The long and powerful yet refined aftertaste keeps reverberating fruit generosity while maintaining Cabernet's strength of personality. Drink now through 2030. 21,249 cases made. ÑJL","Year":2013,"Score":95,"Price":"$160 ","":null},
{"Number":45,"Name":"Charles SmithÊRiesling Ancient Lakes Of Columbia Valley Kung Fu Girl Evergreen","Notes":"Tangy and zingy, with lively acidity that balances against gobs of ripe pear and apricot flavors, carrying through the long, lime-accented finish. Drink now through 2020. 160,000 cases made. ÑHS","Year":2015,"Score":90,"Price":"$12 ","":null},
{"Number":46,"Name":"Quinta de CabrizÊDo","Notes":"A crisp and minerally red, with concentrated flavors of dark cherry, roasted plum and dried raspberry, layered with rich, spicy notes. White chocolate details show on the finish, accented by hints of pepper. Drink now through 2020. 208,000 cases made. ÑKM","Year":2014,"Score":90,"Price":"$10 ","":null},
{"Number":47,"Name":"HallÊCabernet Sauvignon Napa Valley Eighteen Seventy-Three","Notes":"Ultrarich, layered and tightly focused on a dense core of meaty blackberry, currant, loamy earth, anise, crushed rock and graphite notes. For all the flavor and depth, this features a persistent finish that folds in smoky, toasty oak, adding an extra dimension of texture, flavor and aroma. Drink now through 2028. 4,723 cases made. ÑJL","Year":2013,"Score":94,"Price":"$80 ","":null},
{"Number":48,"Name":"Fournier Pre & FilsÊSancerre Les Belles Vignes","Notes":"Very pure and chiseled, with gooseberry, straw and flint flavors tightly coiled, driven by a mouthwatering fleur de sel note through the long, bone-dry finish, which is built on minerality. Drink now through 2021. 7,000 cases imported. ÑJM","Year":2015,"Score":92,"Price":"$26 ","":null},
{"Number":49,"Name":"RenieriÊBrunello di Montalcino Riserva","Notes":"This is reminiscent of a fine Burgundy, showing berry, fading cherry, spice and chalky mineral notes. Juicy and elegant, firm yet harmonious, this lingers with a long, complex aftertaste. Best from 2018 through 2033. 1,000 cases made. ÑBS","Year":2010,"Score":96,"Price":"$100 ","":null},
{"Number":50,"Name":"Real Companhia VelhaÊDouro Evel Red","Notes":"A lithe red, with good cut to the red berry and plum tart flavors, supported by fresh acidity, showing notes of pepper and hot stone on the minerally finish. Offers impressive purity to the fruit components. Drink now through 2020. 60,000 cases made. ÑKM","Year":2014,"Score":90,"Price":"$13 ","":null},
{"Number":51,"Name":"M. ChapoutierÊCtes du Roussillon-Villages Les Vignes de Bila-Haut","Notes":"This red is supple and fresh, showing a mix of dark berry, plum, herbal tea and peppery flavors. Lightly grippy tannins frame the licorice- and mineral-accented finish. Drink now through 2018. 55,000 cases made. ÑGS","Year":2014,"Score":90,"Price":"$15 ","":null},
{"Number":52,"Name":"Bodegas Palacios RemondoÊRioja La Montesa Crianza","Notes":"A thick texture carries plum tart, orange peel, toasted vanilla and anise flavors in this ripe version, balanced by juicy acidity. The spicy, berry-scented finish is long and pure. Drink now through 2023. 10,800 cases imported. ÑTM","Year":2013,"Score":91,"Price":"$20 ","":null},
{"Number":53,"Name":"Familia ZuccardiÊCabernet Sauvignon Uco Valley Q","Notes":"A refined and savory red, featuring notes of white pepper to the cherry and crushed red plum flavors. Lengthens out on the palate, with medium-grained tannins. Silky finish. Drink now through 2020. 7,500 cases made. ÑKM","Year":2013,"Score":91,"Price":"$20 ","":null},
{"Number":54,"Name":"Fritz HasselbachÊRiesling QbA Rheinhessen Fritz's","Notes":"Redolent of white raspberry jam and mint, this white is lush and creamy midpalate, with crackling acidity. The off-dry finish delivers honey and spice details. Drink now through 2018. 20,000 cases made. ÑKM","Year":2014,"Score":90,"Price":"$14 ","":null},
{"Number":55,"Name":"Grard BertrandÊGrenache-Syrah-Mourvdre Corbires","Notes":"Full-bodied and powerful, with decadent layers of raspberry compote, kirsch and red plum notes that are met with savory details of herb and cured meat. Offers a tangy, hot stoneÐaccented finish. Drink now through 2025. 18,000 cases made. ÑGS","Year":2014,"Score":90,"Price":"$19 ","":null},
{"Number":56,"Name":"Bodegas Cepa 21ÊRibera del Duero","Notes":"This aromatic red is graceful on the palate, with cherry, strawberry, licorice and vanilla notes mingling over light tannins, kept lively by bright acidity. This has a tender texture, but shows depth and focus. Drink now through 2021. 16,000 cases made. ÑTM","Year":2011,"Score":92,"Price":"$25 ","":null},
{"Number":57,"Name":"Cave de RoquebrunÊSt.-Chinian-Roquebrun La Grange des Combes","Notes":"A muscular but polished red, with brooding blackberry pie, dark cherry and roasted plum notes complemented by iron, peppercorn and licorice details. Full but not overpowering tannins linger on the savory, herb-tinged finish. Syrah, Grenache and Mourvdre. Drink now through 2022. 12,000 cases made. ÑGS","Year":2015,"Score":91,"Price":"$20 ","":null},
{"Number":58,"Name":"Castello di MonsantoÊChianti Classico Riserva","Notes":"Pure cherry takes center stage, framed by tar, earth, tobacco and mineral elements. Vivid and elegant, showing fine intensity and equilibrium, with a lingering aftertaste. Drink now through 2020. 17,000 cases imported. ÑBS","Year":2013,"Score":91,"Price":"$25 ","":null},
{"Number":59,"Name":"Via San PedroÊCabernet Sauvignon Maipo Valley 1865 Single Vineyard","Notes":"Rich and refined, with good cut to the red plum, crushed berry and raspberry flavors matched to notes of sandalwood and cardamom. Creamy midpalate, with a finish that's filled with chocolate and dark currant details. Drink now through 2021. 50,000 cases made. ÑKM","Year":2014,"Score":91,"Price":"$18 ","":null},
{"Number":60,"Name":"Roberto AnselmiÊVeneto White San Vincenzo","Notes":"An expressive white, creamy and lightly juicy throughout, offering flavors of blood orange granita, fresh tarragon, yellow peach and mineral, set in a light-bodied frame. The finish is juicy. Garganega with Sauvignon Blanc and Chardonnay. Drink now through 2019. 41,660 cases made. ÑAN","Year":2015,"Score":90,"Price":"$18 ","":null},
{"Number":61,"Name":"Joseph DrouhinÊSt.-Vran","Notes":"Though rich, this is offset by vivid acidity, creating a nice tension to the lemon, apple and melon flavors. Long and tangy on the finish. Drink now through 2018. 8,000 cases imported. ÑBS","Year":2014,"Score":90,"Price":"$19 ","":null},
{"Number":62,"Name":"Bodegas OntaonÊViura Rioja Vetiver","Notes":"This bold white marries expressive flavors to a muscular texture. Pear and quince notes mingle with brioche, chamomile and dried pineapple details, with juicy acidity and light tannins lending support. Lively now, this should harmonize with time. Drink now through 2024. 2,000 cases made. ÑTM","Year":2014,"Score":91,"Price":"$15 ","":null},
{"Number":63,"Name":"Tenute di EmraÊPrimitivo di Manduria Antica Masseria del Sigillo","Notes":"There's a rich, mouthfilling quality to this medium-bodied red, offering a velvety mix of spiced cherry, mulberry and herbed olive, with accents of mocha and graphite. Plush tannins show on the juicy finish. Drink now through 2021. 2,500 cases made. ÑAN","Year":2014,"Score":90,"Price":"$17 ","":null},
{"Number":64,"Name":"Bodega ColomÊMalbec Salta Autntico","Notes":"Fresh, rich and juicy, with lively raspberry, cherry and red plum flavors backed by fresh, crunchy acidity. Lengthens out nicely midpalate, showing mineral and pepper accents. Hints of slate and tangerine emerge on the complex finish. Drink now through 2020. 3,500 cases made. ÑKM","Year":2014,"Score":92,"Price":"$25 ","":null},
{"Number":65,"Name":"La Rioja AltaÊRioja 904 Gran Reserva","Notes":"This supple red delivers bright, focused flavors of dried cherry, orange peel, vanilla, sandalwood, tobacco and spice, with light tannins and fresh acidity. An elegant rendering of the traditional style. Drink now through 2022. 12,500 cases made. ÑTM","Year":2007,"Score":93,"Price":"$55 ","":null},
{"Number":66,"Name":"Domaine HutÊVouvray Moelleux Clos du Bourg Premire Trie","Notes":"Concentrated, with a core of intense Jonagold apple, glazed Bosc pear, ginger cream and dried quince flavors, carried by filigreed acidity and backed by green tea, verbena, chamomile and persimmon notes. The finish is extremely long. Best from 2018 through 2040. 300 cases imported. ÑJM","Year":2015,"Score":97,"Price":"$70 ","":null},
{"Number":67,"Name":"HahnÊPinot Noir Santa Lucia Highlands SLH","Notes":"The texture is plush, with lots of complex flavors, ranging from plum to anise to dusty, cedary oak. Satisfying from start to finish, ending with dusty, nutmeg-scented tannins. Drink now. 26,500 cases made. ÑJL","Year":2014,"Score":92,"Price":"$30 ","":null},
{"Number":68,"Name":"LemelsonÊPinot Noir Willamette Valley Thea's Selection","Notes":"Polished, expressive and deftly balanced, this is generous with its baby powderÐaccented cherry, lingonberry and floral flavors. Remains open and inviting through the long finish. Drink now through 2022. 9,950 cases made. ÑHS","Year":2014,"Score":92,"Price":"$30 ","":null},
{"Number":69,"Name":"CARMÊDouro Reserva","Notes":"Suave and rich, showing luscious sandalwood notes to the dried cherry and raspberry flavors. The creamy finish lingers with cocoa powder and white pepper accents. Drink now through 2020. 15,000 cases made. ÑKM","Year":2012,"Score":91,"Price":"$22 ","":null},
{"Number":70,"Name":"RavinesÊRiesling Finger Lakes Dry","Notes":"A taut, dry style, with pure lime, kiwifruit and pippin apple flavors backed by a slate note that gives the finish good tension and length. Very solid. Drink now through 2017. 5,475 cases made. ÑJM","Year":2014,"Score":90,"Price":"$18 ","":null},
{"Number":71,"Name":"Two HandsÊShiraz McLaren Vale Lily's Garden","Notes":"Notes of espresso and toasted hazelnut are rich and thick, with mocha-accented tannins that lend a velvety backdrop to the polished blackberry, licorice and black cherry flavors, lingering generously on the long finish. Drink now through 2030. 2,470 cases made. ÑMW","Year":2014,"Score":94,"Price":"$69 ","":null},
{"Number":72,"Name":"Jules TaylorÊPinot Noir Marlborough","Notes":"Fragrant and ebullient, with caramel and vanilla bean accents to the core of ripe black cherry and plum flavors, balanced by velvety tannins and dark chocolate nuances. Expressive and generous on the long finish. Drink now through 2026. 2,000 cases made. ÑMW","Year":2015,"Score":93,"Price":"$19 ","":null},
{"Number":73,"Name":"KorbelÊBrut California Organic Grapes","Notes":"Crisp and luscious, this is a winning bubbly for a big party. Aromas of cinnamon, ginger and citrus lead to creamy flavors of pear and blanched almond. Drink now. 15,000 cases made. ÑTF","Year":NV,"Score":90,"Price":"$14 ","":null},
{"Number":74,"Name":"Bodega NortonÊMalbec Mendoza Reserva","Notes":"This has a silky mouthfeel, with rich, plush flavors of boysenberry, dark currant and black olive that carry plenty of creamy accents. Features dark chocolate and Asian spice details on the finely textured finish. Drink now through 2020. 125,000 cases imported. ÑKM","Year":2014,"Score":90,"Price":"$19 ","":null},
{"Number":75,"Name":"Bodegas GodevalÊValdeorras Via Godeval Cepas Vellas","Notes":"Pear, peach and quince flavors mingle in this expressive white, while notes of mineral, tangerine and ginger add complexity. Shows depth and focus, with a clean, juicy finish. Drink now. 1,800 cases imported. ÑTM","Year":2014,"Score":91,"Price":"$20 ","":null},
{"Number":76,"Name":"CarpinetoÊVino Nobile di Montepulciano Riserva","Notes":"A rich, powerful style, this evokes black cherry, black currant, plum, leather and tar flavors. Balanced and ready to enjoy, with lingering accents of spice and tobacco. Drink now through 2023. 15,000 cases made. ÑBS","Year":2011,"Score":93,"Price":"$31 ","":null},
{"Number":77,"Name":"Bodegas Hidalgo La GitanaÊOloroso Jerez Faraon","Notes":"Intense, with roasted almond, Brazil nut and walnut notes lending this a slightly burly aspect, while gunpowder tea, bitter orange and almond accents add a taut feel through the finish. This is a distinctive, edgy version that Sherry geeks will dig. Drink now. 1,500 cases made. ÑJM","Year":NV,"Score":92,"Price":"$27 ","":null},
{"Number":78,"Name":"Jean Perrier & FilsÊSavoie Apremont Cuve Gastronomie","Notes":"Yellow apple, fennel and lemon zest notes form the core, while lively floral and quinine accents stretch out the finish. Not big, but offers lovely cut and purity. Very refreshing. Drink now through 2017. 9,500 cases made. ÑJM","Year":2015,"Score":90,"Price":"$16 ","":null},
{"Number":79,"Name":"TzoraÊJudean Hills White","Notes":"Offers a spicy aroma, with pure, mineral-infused flavors of Granny Smith apple, lemon curd and pineapple, accented by notes of toasted coconut. The finish has crme brle hints that linger with plenty of richness. Chardonnay and Sauvignon Blanc. Kosher. Drink now through 2020. 2,000 cases made. ÑKM","Year":2014,"Score":92,"Price":"$30 ","":null},
{"Number":80,"Name":"Lemos & van ZellerÊDouro Quinta Vale D. Maria","Notes":"Ripe, rich and lushly spiced, this muscular red features dark cherry and plum compote flavors that are accented by light pepper notes. Dark chocolate and cardamom accents show on the creamy finish. Drink now through 2022. 1,800 cases made. ÑKM","Year":2013,"Score":94,"Price":"$68 ","":null},
{"Number":81,"Name":"Via CobosÊChardonnay Mendoza Felino","Notes":"A richly spiced white, with focused, well-structured flavors of dried apple, ripe citrus and guava. Brioche notes show on the firm finish. Drink now through 2019. 4,500 cases imported. ÑKM","Year":2015,"Score":90,"Price":"$21 ","":null},
{"Number":82,"Name":"KistlerÊChardonnay Carneros Hudson Vineyard","Notes":"Combines richness with a creamy texture, allowing the taut citrus, pear, melon and fig notes to fan out, gaining depth and length. Displays beautifully integrated smoky oak nuances. Drink now through 2020. 1,060 cases made. ÑJL","Year":2013,"Score":94,"Price":"$80 ","":null},
{"Number":83,"Name":"Mud HouseÊPinot Noir Central Otago","Notes":"Fleshy and appealing, with vibrant cherry and plum notes that have nutmeg and black tea flavors lingering on the finish. Offers good intensity and a velvety texture. Drink now through 2026. 1,000 cases imported. ÑMW","Year":2014,"Score":90,"Price":"$15 ","":null},
{"Number":84,"Name":"Boars' ViewÊPinot Noir Sonoma Coast","Notes":"Bold, rich and assertive, with lively acidity and a tight, dense core of raspberry and blackberry, revealing rose, anise and spice scents. Supple, graceful and deep, this ends with a long, rich aftertaste and a supple, caressing texture. Drink now through 2024. 948 cases made. ÑJL","Year":2013,"Score":95,"Price":"$125 ","":null},
{"Number":85,"Name":"Domne WachauÊGrner Veltliner Smaragd Trocken Wachau Terrassen","Notes":"Voluptuous and richly spiced, with some honeyed notes to the ripe apple, pear tart and glazed apricot flavors. Shows seductive smokiness midpalate, presenting a pastry-accented finish. Drink now through 2021. 6,000 cases made. ÑKM","Year":2013,"Score":92,"Price":"$30 ","":null},
{"Number":86,"Name":"Vigneti del VultureÊAglianico del Vulture Piano del Cerro","Notes":"A dense and tarry red that glides on the silky palate, with mouthwatering acidity framing flavors of blueberry puree, chocolate-covered cherry, vanilla, dried thyme and oak spice. An expressive version in a modern style, yet refined and harmonious overall, with the grippy finish echoing the ripe fruit and tarry mineral character. Drink now through 2027. 5,000 cases made. ÑAN","Year":2012,"Score":93,"Price":"$36 ","":null},
{"Number":87,"Name":"A. ClapeÊCornas","Notes":"Dark and brooding, this has a deep well of black currant, fig and bitter plum fruit in reserve, shrouded for now in smoldering charcoal, bay leaf and alder notes. Tapenade and tar details hang in the background. Offers a steel beam of a finish. Tuck this away in the back corner of your cellar. Best from 2020 through 2035. 1,438 cases made. ÑJM","Year":2013,"Score":96,"Price":"$120 ","":null},
{"Number":88,"Name":"Arnaldo CapraiÊGrechetto Colli Martani Grecante","Notes":"Thai basil and spice notes lace the creamy mix of Asian pear, white peach, stone and lemon zest in this well-knit white. Light- to medium-bodied and fresh, with a lingering, savory finish. Drink now through 2020. 10,800 cases made. ÑAN","Year":2015,"Score":90,"Price":"$20 ","":null},
{"Number":89,"Name":"D. KourtakisÊAssyrtiko Santorini Greek Wine Cellars","Notes":"A creamy white, with notes of dried coconut to the ripe apple, baked pear and lemon curd flavors. The richly spiced finish features accents of dried mint and sage. Drink now through 2020. 10,000 cases made. ÑKM","Year":2014,"Score":90,"Price":"$20 ","":null},
{"Number":90,"Name":"Domaines BunanÊBandol Ros Moulin des Costes","Notes":"Offers a lovely combination of zip and richness, with creamy edges around a core of delicious white cherry and white peach flavors, all offset by a pure beam of minerality that pierces through from start to finish. Drink now through 2017. 4,000 cases made. ÑJM","Year":2015,"Score":91,"Price":"$30 ","":null},
{"Number":91,"Name":"Agricola PunicaÊIsola dei Nuraghi Montessu","Notes":"An elegant version, with Asian five-spice powder and cherry blossom notes wafting through flavors of black raspberry preserves, bresaola and cured tobacco. Long and supple, presenting a mineral-tinged finish. Carignano, Syrah, Cabernet Sauvignon, Cabernet Franc and Merlot. Drink now through 2021. 12,500 cases made. ÑAN","Year":2014,"Score":90,"Price":"$30 ","":null},
{"Number":92,"Name":"Philippe AllietÊChinon","Notes":"Lovely cherry pit, damson plum and violet notes stream through, picking up light savory and olive details along the way. The fresh finish features an iron echo. Very pure from start to finish. Drink now through 2020. 2,300 cases made. ÑJM","Year":2015,"Score":91,"Price":"$23 ","":null},
{"Number":93,"Name":"Galil MountainÊYiron Galilee","Notes":"A rich and plush red, with a deep well of blackberry pie, dark plum and hot stone flavors that fold together seamlessly. Creamy midpalate, presenting a finish that oozes with chocolate mousse and Asian spice details. Unctuous. Cabernet Sauvignon, Merlot, Syrah and Petit Verdot. Kosher. Drink now through 2020. 10,800 cases made. ÑKM","Year":2013,"Score":92,"Price":"$32 ","":null},
{"Number":94,"Name":"William FvreÊChablis Domaine","Notes":"This is delicate, featuring lemon, herb and stone flavors lifted by the fine acidity. Touches of seashore and oyster shell add depth as this coasts to a clean finish. Drink now through 2018. 4,000 cases imported. ÑBS","Year":2014,"Score":90,"Price":"$32 ","":null},
{"Number":95,"Name":"PlumpJackÊSyrah Napa Valley","Notes":"Well-built and richly structured, with bold aromas of blackberry, mocha and licorice, showing layered flavors of smoky raspberry, grilled herb and pepper. The tannins are big, but ripe and balanced. Drink now through 2028. 1,750 cases made. ÑTF","Year":2013,"Score":93,"Price":"$56 ","":null},
{"Number":96,"Name":"Nicolas-JayÊPinot Noir Willamette Valley","Notes":"Broad, expressive and light-footed, this brims with cherry, plum, licorice and cashew flavors that keep singing on the focused finish. Drink now through 2024. 1,750 cases made. ÑHS","Year":2014,"Score":93,"Price":"$65 ","":null},
{"Number":97,"Name":"Le MacchioleÊBolgheri","Notes":"Sleek and elegant, with concentrated flavors of black cherry, black currant, cedar and vanilla. A wild, aromatic underbrush character lingers on the beefy finish. Merlot, Cabernet Franc and Syrah. Best from 2018 through 2024. 900 cases imported. ÑBS","Year":2013,"Score":91,"Price":"$34 ","":null},
{"Number":98,"Name":"Dakota ShyÊCabernet Sauvignon Napa Valley","Notes":"Showcases Cabernet in a harmonious, graceful pose. Though big and rich, this is deftly balanced and easy to approach, with tiers of spicy black licorice, red and dark berry, mocha, mineral, sage and floral notes. Shows depth and dimension overall. Drink now through 2032. 800 cases made. ÑJL","Year":2014,"Score":94,"Price":"$95 ","":null},
{"Number":99,"Name":"CirqÊPinot Noir Russian River Valley Treehouse","Notes":"Combining power and finesse, this is rich and extracted, with a supple yet gutsy core of mineral-laced tannins that weave into a mix of gravelly, loamy earth, juicy blackberry and wild berry. Drink now through 2022. 1,748 cases made. ÑJL","Year":2013,"Score":94,"Price":"$125 ","":null},
{"Number":100,"Name":"Louis LatourÊCorton-Charlemagne","Notes":"A broad, charming white, featuring lemon, baked apple, vanilla, clove and nutmeg flavors, with fine concentration and length. Shows a bright structure and chalky intensity on the slightly tannic finish. Best from 2019 through 2032. 3,100 cases made. ÑBS","Year":2014,"Score":95,"Price":"$175 ","":null}]